Revit 2027 API
DirectShapeTypeOptions Properties
The DirectShapeTypeOptions type exposes the following members.
Properties
Name | Description
AllowDuplicateNames |  Determines whether or not duplicate DirectShapeType names are allowed.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
DirectShapeTypeOptions Class
Autodesk.Revit.DB Namespace